# Programming and Problem Solving
### Day No - 14
### Date - 17 May 2019

# Day Outcomes
1. pandas package

#

# Problem 1: 
### Problem Statement: Define a function to read from a csv file using the pandas library. Display the file data as output.

In [1]:
import pandas as pd

def readCSV(filename):
    df = pd.read_csv(filename)  # df is a data frame -- returns a 2D matrix -- part of the data
    return df

readCSV('DataFiles/Income.csv')

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

#

###  Accessing Data from a csv file

In [2]:
df = readCSV('DataFiles/Income.csv')
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [3]:
for  row in df.values:
    print('GeoId: ', row[0], ' ', 'State: ', row[1])

GeoId:  04000US01   State:  Alabama
GeoId:  04000US02   State:  Alaska
GeoId:  04000US04   State:  Arizona
GeoId:  04000US05   State:  Arkansas
GeoId:  04000US06   State:  California

In [4]:
df = readCSV('DataFiles/Income.csv')
df.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [5]:
df = readCSV('DataFiles/Income.csv')
df.values[0]  # prints a particular row

array(['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
       42590, 43464, 41381], dtype=object)

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.head(3)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602

In [9]:
df.tail(2)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [10]:
df.iat[1,6]

61604

In [11]:
df.iat[2, 0]

'04000US04'

In [12]:
df.loc[2][0]

'04000US04'

In [13]:
df.loc[2]

GEOID    04000US04
State      Arizona
2005         45245
2006         46657
2007         47215
2008         46914
2009         45739
2010         46896
2011         48621
2012         47044
2013         50602
Name: 2, dtype: object

#

# Problem 2: 
### Problem Statement: Define a function to add new row data to a csv file

In [14]:
import pandas

def addRowCSV(filename, rowData):
    df = readCSV(filename)  # get dataframe from CSV
    df.loc[len(df)] = rowData  # add a row to the data frame
    df.to_csv(filename, index = False)  # send the dataframe back to CSV
    return df

rowData = ['04000US08', 'Colorado', 46526, 87345, 74457, 79586, 45567, 76879, 89568, 96757, 98465]
addRowCSV('DataFiles/Income.csv', rowData)
# df = df.drop() -- to drop any row or column

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
5,04000US08,Colorado,46526,87345,74457,79586,45567,76879,89568,96757,98465

#

# Problem 3: 
### Problem Statement: Define a function to update / modify an existing row in a csv file

In [15]:
def updateRowCSV(filename, rowindex, rowdata):
    df = readCSV(filename)
    df.loc[rowindex] = rowdata
    df.to_csv(filename, index = False)
    return df

rowdata = ['04000US09', 'San Fransisco', 46526, 87345, 74457, 79586, 45567, 76879, 89568, 96757, 98465]
updateRowCSV('DataFiles/Income.csv', 6, rowdata)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
5,04000US08,Colorado,46526,87345,74457,79586,45567,76879,89568,96757,98465
6,04000US09,San Fransisco,46526,87345,74457,79586,45567,76879,89568,96757,98465

#

# Problem 4: 
### Problem Statement: Define a function to delete a row from a csv file

In [16]:
def deleteRowCSV(filename, rowindex):
    df = readCSV(filename)
    df.drop(rowindex, axis = 0, inplace = True)  # axis = 0 --> row; axis = 1 --> column
    df.to_csv(filename, index = False)
    return df

deleteRowCSV('DataFiles/Income.csv', 2)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
5,04000US08,Colorado,46526,87345,74457,79586,45567,76879,89568,96757,98465
6,04000US09,San Fransisco,46526,87345,74457,79586,45567,76879,89568,96757,98465

In [17]:
df  # checking whether the row got deleted or not

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528